package smo.zooket;

import android.app.Activity;
import android.app.AlertDialog;
import android.content.Context;
import android.content.Intent;
import android.graphics.Color;
import android.graphics.Rect;
import android.os.Handler;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.text.Editable;
import android.text.TextWatcher;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.view.Window;
import android.widget.ArrayAdapter;
import android.widget.AutoCompleteTextView;
import android.widget.EditText;
import android.widget.ImageView;
import android.widget.LinearLayout;
import android.widget.ListView;
import android.widget.Toast;

import smo.zooket.Util.Toaster;
import uk.co.chrisjenx.calligraphy.CalligraphyConfig;
import uk.co.chrisjenx.calligraphy.CalligraphyContextWrapper;

public class MainnActivity extends AppCompatActivity {
    String[] Districts =
            {"16 آذر", "22 بهمن", "آبشار", "آبشار-رزمندگان", "آجودانیه", "آذربایجان از نواب تا کارگر", "آذربایجان از کارگر تا ولیعصر", "آرارات جنوبی", "آرارات شمالی", "آرژانتین", "آریافر",
                    "آزادی-توحید", "آفتاب-خدامی", "آفریقا (جردن) از آرش تا مدرس", "آفریقا (جردن) از جهان کودک تا میرداماد",
                    "آفریقا (جردن) از جهان کودک تا همت", "آفریقا (جردن) از میرداماد تا آرش", "آفریقا (جردن) از همت تا آرژانتین",
                    "آیت از نبوت تا ثانی-نارمک", "آیت الله کاشانی از علامه جعفری تا باکری", "آیت پایین تر از ثانی", "آیت-میدان نبوت-نارمک",
                    "ابن سینا-پل چوبی", "ابن یمین", "ابوذر-بسیج بالاتر از ائمه اطهار", "ابوذر-بسیج پایین تر از ائمه اطهار", "ابوذر-نبرد-زمزم",
                    "ابوسعید", "اثنی عشری (شانزده متری دوم)", "اجاره دار بالاتر از شیخ صفی", "اجاره دار پایین تر از شیخ صفی",
                    "اراج-گلزار", "اردوگاه با هنر", "ازگل", "استخر", "اسماعیل آباد", "اسکندری", "اشرفی از حکیم تا صادقیه",
                    "اشرفی از همت تا حکیم", "اشرفی از پونک تا همت", "اشرفی اصفهانی از چهاردیواری تا پونک", "افسریه", "اقدسیه",
                    "البرز-ژاندارمری", "الهیه-صدر", "الهیه-مریم", "الوند", "امام خمینی (ره) از میدان حر تا حسن آباد", "امام زاده عبدالله",
                    "امام علی (ع) از نظام آباد تا دماوند", "امام علی(ع) از ارتش تا بابایی", "امام علی(ع) از زین الدین تا رسالت",
                    "امیرآباد", "امیرآباد-دانشکاه تهران", "امیرآباد-کارگر", "امیراتابک", "امیرکبیر", "انبار نفت", "اندرزگو", "اندیشه",
                    "اندیشه-شهرزیبا", "انقلاب-دانشگاه تهران", "انقلاب-میدان فردوسی", "انقلاب-کالج", "اوین", "ایثار-مرزداران", "ایرانشناسی",
                    "ایرانشهر بالاتر از طالقانی", "ایستگاه راه آهن", "ایستگاه مترو حقانی", "ایستگاه مترو شهید باقری", "ایستگاه مترو شهید همت",
                    "ایوانک-زرافشان", "بابایی از هنگام تا دماوند", "بازار تهران", "باغ آذری-خزانه", "باغ سفارت انگلیس", "باغ فردوس", "باغ فیض",
                    "باغ پرندگان", "باغ گیاه شناسی ملی ایران", "باقرخان", "باقری از بابایی تا رسالت", "باقری از رسالت تا دماوند", "باهنر-باغ فیض",
                    "باکری از آبشناسان تا آیت الله کاشانی", "باکری از علامه جعفری تا شیخ فضل الله", "باکری از کاشانی تا علامه جعفری", "باکری-سیمون بلیوار",
                    "بخارست (احمد قصیر)", "برادران حسینی-میدان حق شناس", "برادران مظفر", "برج میلاد", "برزیل-توانیر", "برق آلستوم-سازمان آب",
                    "بریانک-سلیمانیه", "بزرگراه آبشناسان", "بزرگراه ارتش", "بزرگراه امام علی از بابایی تا زین الدین", "بزرگراه امام علی(ع) از رسالت تا مدنی",
                    "بزرگراه بابایی", "بزرگراه جلال آل احمد از چمران تا شیخ فضل الله", "بزرگراه جلال از شیخ فضل الله تا یادگار", "بزرگراه جلال از یادگار تا اشرفی اصفهانی",
                    "بزرگراه جناح", "بزرگراه حکیم از چمران تا اشرفی اصفهانی", "بزرگراه زین الدین از باقری تا صیاد", "بزرگراه زین الدین از دماوند تا باقری",
                    "بزرگراه ستاری-اکباتان", "بزرگراه سعیدی از آزادی تا قزوین", "بزرگراه صیاد شیرازی از همت تا صدر", "بزرگراه عباس دوران", "بزرگراه علامه جعفری",
                    "بزرگراه نیایش از پاکنژاد تا اشرفی", "بزرگراه کردستان از همت تا حکیم", "بزرگراه یادگار از حبیب الله تا شیخ فضل الله", "بزرگراه یادگار امام از شیخ فضل الله تا جلال",
                    "بزرگراه یادگار امام از همت تا حکیم", "بزرگراه یاسینی", "بقایی-خاوران", "بلوار آیت الله کاشانی از اشرفی تا ستاری", "بلوار ابوذر", "بلوار اتحاد-احسان",
                    "بلوار استقلال-سراج", "بلوار استقلال-مجیدآباد", "بلوار اسفندیار", "بلوار اوشان", "بلوار ایران زمین", "بلوار بسیج-ارتش", "بلوار بهار",
                    "بلوار بیست و چهار متری", "بلوار تعاون", "بلوار خلیج فارس-ابراهیم آباد", "بلوار خوردین", "بلوار دادمان", "بلوار دانشجو ولنجک",
                    "بلوار درختی-نورانی", "بلوار دریا", "بلوار شاهد", "بلوار شاهد-میدان پروین", "بلوار شاهین شمالی", "بلوار شهرزاد", "بلوار صبا-قیطریه",
                    "بلوار عدل-سردارجنگل", "بلوار فردوس شرق", "بلوار فرهنگ بالاتر از نیایش", "بلوار فرهنگ پایین تر از نیایش", "بلوار قیطریه", "بلوار لاله", "بلوار مدیریت", "بلوار مرزداران از شیخ فضل الله تا آریافر", "بلوار پروین", "بلوار کاوه از صدر تا دولت", "بلوار کاوه-قیطریه", "بلوار کشاورز", "بلوار کوهسار", "بلوار کوهستان", "بلوار گلها", "به آفرین", "بهار جنوبی", "بهار شمالی", "بهارشیراز", "بهبودی", "بهشتی از صابونچی تا مدرس", "بهشتی-مدرس", "بوستان ایران زمین", "بوستان بهشت مادران", "بوستان نهج البلاغه فاز یک", "بوستان نوروز", "بوستان ولایت", "بوستان گفتگو", "بوعلی-مشیریه-ساحل مصنوعی", "بوکان", "بیست متری کرمان", "بیمارستان طالقانی", "بیمارستان میلاد", "بیمارستان ولیعصر", "بیهقی", "تالار وحدت", "ترمینال جنوب", "ترکمنستان-یوسفیان", "تهران نو-جاجرود", "تهرانسر", "توانیر", "تولید دارو", "توچال", "تیموری", "جاده امام رضا از بوعلی تا شهرک قیامدشت", "جاده تلو", "جشنواره-فرهنگسرا", "جعفرآباد", "جلال آل احمد-امیرآباد", "جلفا-ارسباران", "جم (فجر)", "جماران", "جمشیدیه", "جمهوری از حافظ تا فردوسی", "جمهوری از نواب تا کارگر", "جمهوری از ولیعصر تا حافظ", "جمهوری از کارگر تا ولیعصر", "جنت آباد جنوبی-بلوار لاله", "جنت آباد شمالی", "جنت آباد مرکزی",
                    "جهان آرا از 23 تا میدان کلانتری", "جهان آرا از حکیم تا میدان کلانتری", "جهان آرا-قزل قلعه", "جوانمرد قصاب", "جیحون-دامپزشکی", "حافظ از طالقانی تا کالج",
                    "حافظ بالاتر از طالقانی", "حافظ-شیخ هادی", "حبیب الله بالاتر از تیموری", "حبیب الله پایین تر از تیموری", "حجاب", "حسن آباد", "حسینیه ارشاد", "حصارک",
                    "حقانی از مدرس تا همت", "حقانی از همت تا رسالت", "حقانی از ونک تا مدرس", "حکمت-قیطریه", "حکیم از اشرفی تا ستاری", "حکیم از کردستان تا چمران"
                    , "حکیمیه", "خانی آباد نو شمالی", "خاوران-هفده شهریور", "خدامی", "خردمند جنوبی", "خردمند شمالی", "خرمشهر (آپادانا)", "خزانه بخارایی-بعثت", "خزانه فلاح",
                    "خواجه عبدالله انصاری-شهید عراقی", "خواجه نصیر-نامجو", "خیابان دولت آبادی", "خیابان سپاه", "خیابان نامجو", "خیابان ونک از شیخ بهایی تا کردستان",
                    "خیابان ونک از کردستان تا ولیعصر", "خیام از امام خمینی (ره) تا پانزده خرداد", "خیام-بازار", "خیام-شوش", "دادمان-شفق", "دارآباد", "دامن افشار", "دانشکده روانشناسی تربیت مدرس",
                    "دانشکده عمران-خواجه نصیر", "دانشکده کشاورزی تربیت مدرس", "دانشگاه آزاد اسلامی واحد علوم تحقیقات", "دانشگاه امام حسین", "دانشگاه امام صادق(ع)-فاز 4",
                    "دانشگاه امام علی(ع)", "دانشگاه امیرکبیر-دبیرستان البرز", "دانشگاه شهید بهشتی", "دانشگاه صنعتی شریف", "دانشگاه علم و صنعت", "دانشگاه علوم پزشکی بقیه الله", "درب-دوم", "دربند-گلاب دره",
                    "دردشت بالاتر از جانبازان", "دردشت پایین تر از جانبازان", "دروازه دولت", "دروس-احتشامیه", "درکه", "دریان نو", "دریاچه چیتگر", "دزاشیب", "دلاوران-الغدیر", "دماوند از امام علی تا سبلان",
                    "دماوند از بابایی تا رسالت", "دماوند از تیرانداز تا باقری", "دماوند از سبلان تا باقری", "ده ونک", "دهم فروردین", "دهم فروردین از محلاتی تا آهنگ", "دهکده المپیک", "دوراهی قلهک",
                    "دولت آباد-حسین آباد", "دولت از شریعتی تا نعمتی", "دولت از قنات تا چهارراه پاسداران", "دولت از نعمتی تا قنات", "دولت خواه", "دکتر معین-دامپزشکی", "دیباجی جنوبی-اختیاریه",
                    "دیباجی شمالی", "رسالت از باقری تا دماوند", "رسالت از صیاد تا امام علی (ع)", "رسالت از میدان تا باقری", "رشید یاسمی", "ری", "ری-محلاتی", "زاهد گیلانی", "زرافشان-فلامک", "زرتشت شرقی",
                    "زرند-میدان فتح", "زرگنده", "زعفرانیه", "زهتابی-زمزم", "زیبا دشت-شهرک گلستان", "سئول از نیایش تا شیخ بهایی", "سئول از نیایش تا چمران", "سازمان آب از شیخ فضل الله تا یادگار",
                    "سازمان آب از یادگار تا آیت الله کاشانی", "سازمان برنامه جنوبی", "سازمان فرهنگ و ارتباط اسلامی", "سبلان جنوبی از چهارراه نظام آباد", "سبلان شمالی", "سبلان شمالی از صیاد تا امام علی (ع)",
                    "ستارخان از شیخ فضل الله تا یادگار", "ستارخان از میدان توحید تا شیخ فضل الله", "ستارخان-صادقیه", "ستاری از باکری تا حکیم", "ستاری از حکیم تا همت", "ستاری-سیمون بلیوار",
                    "سجاد جنوبی", "سجاد شمالی", "سراج-اردیبهشت", "سرافراز", "سردارجنگل", "سرسبز جنوبی", "سرسبز شمالی", "سرو شرقی", "سرو غربی", "سعادت آباد از نیایش تا مدیریت", "سعادت آباد بالاتر از کاج",
                    "سعادت آباد-شهرداری جنوبی", "سعدآباد", "سعدی", "سعید آباد", "سفارت انگلیس", "سفارت روسیه-نوفل لوشاتو", "سلیمانیه-اصفهانک", "سمنگان", "سمنگان از رسالت تا گلبرگ", "سمیه",
                    "سنایی", "سنگلج", "سهروردی جنوبی از مطهری تا بهارشیراز", "سهروردی شمالی از بهشتی تا مطهری", "سهروردی شمالی از قندی تا هویزه", "سهروردی-بهشتی", "سوهانک", "سپر-ژاندارمری",
                    "سپهبد قرنی بالاتر از طالقانی", "سی تیر", "سی متری جی", "سی متری نیروی هوایی", "سیدخندان", "سیمای ایران", "سیمون بلیوار", "سیمون بلیوار-چهاردیواری", "شادآباد", "شارق-نظام آباد",
                    "شاهد-دماوند-تیرانداز", "شاهین جنوبی-بلوار لاله", "شریعتی از بهارشیراز تا پیچ شمیران", "شریعتی از تجریش تا قیطریه", "شریعتی از دولت تا ظفر", "شریعتی از سیدخندان تا قصر",
                    "شریعتی از صدر تا دولت", "شریعتی از ظفر تا میرداماد", "شریعتی از قصر تا مطهری", "شریعتی از مطهری تا بهارشیراز", "شریعتی از میرداماد تا همت", "شریعتی از همت تا سیدخندان", "شریعتی-پل رومی-صدر", "شهر ری", "شهرآرا",
                    "شهران جنوبی", "شهران شمالی", "شهرداری تجریش", "شهرداری شمالی", "شهرزیبا-آیت الله کاشانی", "شهرک آزمایش", "شهرک آپادانا", "شهرک استقلال", "شهرک المهدی", "شهرک امام خمینی",
                    "شهرک امام خمینی(ره)", "شهرک امید", "شهرک امید-لویزان", "شهرک انصار", "شهرک اکباتان فاز دو", "شهرک اکباتان-فاز یک", "شهرک بروجردی", "شهرک دانشگاه تهران", "شهرک سئول",
                    "شهرک سینمایی غزالی", "شهرک شهید خرازی", "شهرک شهید فلاحی", "شهرک صدف", "شهرک فاطمه زهرا (ع)", "شهرک فجر", "شهرک فرهنگیان", "شهرک فکوری", "شهرک قائم",
                    "شهرک لویزان", "شهرک نفت-چهار دیواری", "شهرک هما", "شهرک والفجر-شهرک قدس", "شهرک چیتگر", "شهرک کلاهدوز-شهرک فجر", "شهرک کوثر", "شهریار-یوسف آباد", "شهید ثانی",
                    "شهید صفایی", "شهید عراقی بالاتر از همت", "شهید همایی (شانزده متری اول)", "شهید گمنام-فاطمی (جهاد)", "شوش", "شوش-مختاری", "شکوفه-چهارصد دستگاه", "شیان",
                    "شیخ بهایی جنوبی", "شیخ بهایی جنوبی از ملاصدرا تا همت", "شیخ بهایی شمالی تا ملاصدرا", "شیخ صفی", "شیخ فضل الله از جناح تا ستارخان", "شیخ فضل الله از ستارخان تا مرزداران",
                    "شیخ فضل الله از میدان صنعت تا حکیم", "شیخ فضل الله-اکباتان", "شیراز از ملاصدرا تا همت", "شیراز از ونک تا ملاصدرا", "شیراز جنوبی", "صابونچی", "صاحبقرانیه", "صالح آباد شرقی", "صالح آباد غربی",
                    "صد دستگاه", "صدا و سیما", "صدر از مدرس تا کاوه", "صدر از کاوه تا اختیاریه", "صدر-نوبنیاد", "صفا", "صیاد از رسالت تا جانبازان", "صیاد شیرازی از میدان سبلان تا میدان سپاه",
                    "طالقانی از حافظ تا مفتح", "طالقانی از فلسطین تا حافظ", "طالقانی از مفتح تا شریعتی", "طالقانی-میدان فلسطین", "طرشت", "طهرانیه-شهرک صاحب زمان (عج)", "طیب-بیسیم-هفده شهریور"
                    , "ظفر از شریعتی تا مدرس", "عباس ورامینی-بلوار شقایق", "عبدل آباد", "عربعلی", "عشقیار", "عطار", "عظیم آباد-شهرک معراج", "علامه طباطبایی جنوبی", "علامه طباطبایی شمالی", "علی آباد-بلوار دستوار", "علی اکبری",
                    "فاطمی", "فاطمیه", "فتح-مهرآباد", "فتحی شقاقی-میدان سلماس", "فجر-بابائیان", "فدائیان اسلام-مظاهری", "فرجام", "فرحزاد", "فرحزادی از میدان صنعت تا دادمان", "فرحزادی بالاتر از دادمان"
                    , "فرخی یزدی", "فردوس غرب از ستاری تا باکری", "فردوس غرب-بهار شمالی", "فردوسی", "فرشته", "فرصت شیرازی", "فرمانیه از دزاشیب تا کامرانیه", "فرمانیه از کامرانیه تا پاسداران",
                    "فرهنگ-وحدت اسلامی", "فرودگاه مهرآباد", "فلسطین از طالقانی تا انقلاب", "فلسطین از کشاورز تا طالقانی", "فلسطین شمالی-زرتشت غربی", "فلکه اول تهران پارس",
                    "فلکه اول نیروی هوایی", "فلکه دوم تهران پارس-فرجام", "فلکه دوم صادقیه", "فلکه دوم نیرو هوایی", "فلکه سوم تهران پارس", "فلکه چهارم تهران پارس-سه راه استخر",
                    "قائم مقام فراهانی", "قبا", "قرنی فردوسی", "قزل قلعه", "قزوین از سعیدی تا نواب", "قزوین-سه راه آذری", "قصر فیروزه", "قصر-قدوسی", "قصرالدشت-رودکی-کارون-خوش", "قلندری جنوبی", "قلندری شمالی-سهیل",
                    "قلهک", "قنبرزاده", "قیام", "قیطریه", "لاله زار", "لنگری-شهرک چمران", "مازندران", "مجتمع مسکونی آتی ساز", "مجتمع مسکونی سروستان", "مجتمع مسکونی نگین غرب", "مجموعه ورزشی انقلاب",
                    "مجموعه ورزشی شهید کشوری", "مجموعه کاخ نیاوران", "مجیدیه جنوبی", "مجیدیه شمالی", "محمودیه", "محک", "مخصوص-خرمشهر", "مدائن بالاتر از جانبازان-نارمک", "مدائن پایین تر از جانبازان"
                    , "مدرس از همت تا صدر", "مدنی از امام علی تا امام حسین (ع)", "مدنی از رسالت تا گلبرگ", "مدنی از چهارراه نظام آباد تا امام علی (ع)", "مدنی-فدک", "مرزداران-شقایق",
                    "مرزدارن از آریافر تا اشرفی اصفهانی", "مرکز قلب تهران-بیمارستان شریعتی", "مرکز همایش های بین المللی رازی", "مرکز همایش-ولنجک", "مسیل باختر-لشگر", "مسیل باختر-مجیدیه",
                    "مسیل منوچهری", "مصطفی خمینی-امام زاده یحیی", "مصطفی خمینی-مولوی", "مصلای امام خمینی (ره)", "مطهری از سهروردی تا مدرس", "مطهری از شریعتی تا سهروردی",
                    "مطهری-مدرس", "مطهری-ولیعصر", "مطهری-پلیس", "معلم-مرودشت", "مفتح شمالی از بهشتی تا مطهری", "مفتح شمالی پایین تر از مطهری", "مقدس اردبیلی", "مقصود بیک", "ملاصدرا",
                    "ملاصدرا-ده ونک", "ملک آباد", "منظریه-نیاوران", "منیریه", "مهرام (مدبر)", "مهستان-شهرک غرب", "مولوی", "مولوی از ولیعصر تا وحدت اسلامی", "میثاق-آجودانیه", "میدان آزادی", "میدان اراج",
                    "میدان امام خمینی(ره)", "میدان انقلاب", "میدان بهارستان", "میدان تجریش", "میدان حر-امام خمینی (ره)", "میدان خراسان", "میدان دانشجو ولنجک", "میدان دانشگاه علوم تحقیقات", "میدان راه آهن",
                    "میدان رسالت", "میدان سبلان", "میدان سپاه-خواجه نصیر", "میدان شهداء", "میدان شهداء-مجاهدین اسلام", "میدان صنعت", "میدان فاطمی", "میدان قزوین", "میدان مینا", "میدان نامجو",
                    "میدان نوبنیاد", "میدان نیاوران", "میدان هفت تیر", "میدان هلال احمر", "میدان ولیعصر", "میدان ونک", "میدان پاستور",
                    "میدان پونک", "میدان کاج", "میرداماد از مدرس تا شریعتی", "میرداماد از مدرس تا ولیعصر", "میرزای شیرازی", "میرعماد", "نارمک", "نازی آباد-بازار دوم", "ناصر خسرو", "نبرد شمالی-برادران افراسیابی",
                    "نبرد-پاسدار گمنام-فرح آباد", "نجات الهی (ویلا) بالاتر از طالقانی", "نجات الهی (ویلا) بالاتر از کریم خان", "نجات الهی (ویلا)-انقلاب", "نصرت", "نعمت آباد", "نعمتی-قلندری", "نمایشگاه بین المللی تهران",
                    "نوفل لوشاتو-سفارت ایتالیا", "نونهالان", "نیاوران از قدس تا یاسر", "نیاوران از یاسر تا میدان", "نیاوران-پاسداران", "نیایش از پاکنژاد تا چمران", "نیایش از کردستان تا چمران", "نیروی دریایی",
                    "نیروی هوایی", "نیروی هوایی خیابان اول تا چهارم", "هاشم آباد", "هتل بزرگ ارم", "هتل پارسیان استقلال", "هرمزان-پیروزان", "هروی-وفامنش", "هفتده شهریور", "هفده شهریور-شوش",
                    "هفده شهریور-محلاتی", "همت از شیخ فضل الله تا اشرفی", "همت از پل های فجر تا شریعتی", "همت از چمران تا شیخ فضل الله", "همت-ستاری تا آبشناسان", "هنگام از رسالت تا زین الدین",
                    "هنگام بالاتر از زین الدین", "هویزه", "واثقی-سلطانی", "وحدت اسلامی از مولوی تا شوش", "وحدت اسلامی از پارک شهر تا مولوی", "ورداورد", "ورداورد شمالی-شهرک شهید خرازی",
                    "ورزشگاه آزادی", "وزراء (خالد اسلامبولی)", "وصال شیرازی از طالقانی تا انقلاب", "وصال شیرازی از کشاورز تا طالقانی", "ولنجک", "ولیعصر از زرتشت تا میدان", "ولیعصر از زعفرانیه تا تجریش",
                    "ولیعصر از طالقانی تا انقلاب", "ولیعصر از میدان تا طالقانی", "ولیعصر از نیایش تا پارک وی", "ولیعصر از ونک تا نیایش", "ولیعصر از ونک تا نیایش", "ولیعصر از پارک وی تا زعفرانیه",
                    "ولیعصر-بهشتی", "ولیعصر-توانیر", "ولیعصر-جمهوری", "ولیعصر-ساعی", "ولیعصر-فاطمی", "ولیعصر-پاستور", "ولیعصر-پله اول", "ولیعصر-گمرک", "پاتریس لومومبا-شهرارا",
                    "پادگان ولیعصر", "پارک آب و آتش", "پارک اندیشه", "پارک جنگلی خرگوش دره", "پارک جنگلی لویزان", "پارک جنگلی چیتگر",
                    "پارک جنگلی کوهسار", "پارک جنگلی یاس", "پارک دانشجو", "پارک شهر", "پارک طالقانی", "پارک ملت", "پارک نیاوران", "پارک پردیسان", "پاس و فرهنگیان", "پاستور-کاخ مرمر",
                    "پاسداران از نگارستان 10 تا گلستان 2", "پاسداران از همت تا گیلان", "پاسداران از چهارراه تا نوبنیاد", "پاسداران از گل نبی تا نگارستان 10", "پاسداران از گلستان 10 تا صدر", "پاسداران از گلستان 3 تا گلستان 10",
                    "پاسداران ضرابخانه", "پاسداران-زمرد", "پاسداران-فرمانیه", "پاسداران-نوبنیاد", "پاسداران-گلستان", "پالیزی-شهید قندی", "پامنار", "پانزده خرداد", "پاکنژاد از میدان صنعت تا دادمان",
                    "پاکنژاد بالاتر از دادمان", "پل حافظ", "پل چوبی", "پناهی نیا-ساقدوش", "پیروزی از امام علی(ع) تا نبرد", "پیروزی از میدان شهداء تا امام علی(ع)", "پیروزی از نبرد تا یاسینی", "پیچ شمیران-هدایت",
                    "چمران از نیایش تا همت", "چهار دیواری-زیتون", "چهارراه قصر", "چهارراه ولیعصر", "چهارراه پاسداران-مغان", "چیتگر جنوبی", "چیتگر شمالی", "چیذر",
                    "کابلی (دبستان)", "کاج-منبع آب", "کاج-پایین تر از گمنام", "کاخ گلستان-دارالفنون", "کارون جنوبی-امام خمینی (سپه)", "کارگر از جمهوری تا آذربایجان", "کارگر از حر تا قزوین", "کارگر از کشاورز تا انقلاب",
                    "کارگر شمالی از فاطمی تا گمنام", "کارگرشمالی-پارک لاله", "کاشانک-رحمان آباد", "کامرانیه جنوبی", "کامرانیه شمالی", "کتابخانه ملی ایران", "کردستان از ملاصدرا تا رشید", "کردستان از همت تا ملاصدرا",
                    "کردستان پایین تر از حکیم", "کردستان-نیایش-ولیعصر", "کرمان", "کریم خان", "کلیم کاشانی- ادیبی", "کن-بهاران", "کوثر", "کوشا-جوانان", "کوهسار-درکه", "کوی ارم", "کوی بیمه",
                    "کوی فراز", "کوی لاله-سوهانک", "کوی مهرآباد", "کوی نصر مهرآباد", "کوی نوبنیاد", "کوی نور", "کوی هفده شهریور", "کیانشهر-بروجردی", "گاندی جنوبی از حقانی تا همت",
                    "گاندی شمالی", "گاندی پایین تر از همت", "گل افشان", "گل نبی-احمدی روشن", "گلاب-شهدای صادقیه", "گلبرگ شرقی",
                    "گلبرگ غربی از سبلان تا امام علی(ع)", "گلستان جنوبی", "گلستان-فدک", "گلشن دوست", "گلها-فاطمی", "گمرک", "گیشا", "یاخچی آباد-چهارصد دستگاه", "یادگار امام از حکیم تا مرزداران", "یادگار امام از فرحزاد تا نیایش"
                    , "یادگار امام از مرزداران تا سازمان آب", "یادگار امام از نیایش تا همت", "یاسر-نیاوران", "یاسمن-ولنجک", "یافت آباد", "یافت آباد شمالی", "یوسف آباد از 22 تا میدان فرهنگ", "یوسف آباد از 60 تا همت"
                    , "یوسف آباد از فرهنگ تا کلانتری", "یوسف آباد از کلانتری تا 60", "یوسف آباد فتحی شقاقی تا 22", "یوسف آباد پایین تر از فتحی شقاقی", "یوسف آباد-ابن سینا", "یوسف آباد-اکبری"};
    boolean doubleBackToExitPressedOnce;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_mainn);

        //Creating the instance of ArrayAdapter containing list of language names
        ArrayAdapter<String> adapter = new ArrayAdapter<String>
                (this,R.layout.autocomplete_item, R.id.lblListItem,Districts);
        //Getting the instance of AutoCompleteTextView
        final AutoCompleteTextView actv= (AutoCompleteTextView)findViewById(R.id.autoCompleteTextView1);
        actv.setThreshold(1);//will start working from first character
        actv.setAdapter(adapter);//setting the adapter data into the AutoCompleteTextView
        actv.setTextColor(Color.RED);

        ((LinearLayout)findViewById(R.id.district_btn)).setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent MyIntent = new Intent(MainnActivity.this, MainActivity.class);
                MyIntent.putExtra("DistrictName", actv.getText().toString().trim());
                startActivity(MyIntent);
            }
        });
        ((ImageView)findViewById(R.id.location_btn)).setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent MyIntent = new Intent(MainnActivity.this, NearestSupermarketActivity.class);
                startActivity(MyIntent);
            }
        });

//Initialization
        doubleBackToExitPressedOnce = false;
        //Font
        CalligraphyConfig.initDefault(new CalligraphyConfig.Builder()
                .setDefaultFontPath("fonts/BYekan.ttf")
                .setFontAttrId(R.attr.fontPath)
                .build()
        );
    }

    @Override
    public void onBackPressed() {
        if (doubleBackToExitPressedOnce) {
            super.onBackPressed();
        } else {
            this.doubleBackToExitPressedOnce = true;
            Toaster.toast(this, "برای خروج یک بار دیگر دکمه بازگشت را بزنید", Toast.LENGTH_SHORT);
        }
        new Handler().postDelayed(new Runnable() {
            @Override
            public void run() {
                doubleBackToExitPressedOnce = false;
            }
        }, 2000);
    }

    @Override
    protected void attachBaseContext(Context newBase) {
        super.attachBaseContext(CalligraphyContextWrapper.wrap(newBase));
    }

    @Override
    protected void onDestroy() {
        super.onDestroy();
    }

}
